# import pandas as pd
# data=pd.read_excel(r'D:\文档\亚信实习\工作\基站经纬度爬虫\全国行政区划码.xlsx',header=None,names=['行政区划代码','单位名称','省','单位名称1','单位名称2'])
# data1=pd.read_excel(r'D:\文档\亚信实习\工作\基站经纬度爬虫\全国行政区划码-v3.xlsx',header=0)
# for i in data.单位名称:
#     data.loc[data['单位名称']==i,'单位名称1']=i.strip()
#
#
# print(data.columns)
# for prov in data1.单位名称:
#     prov=prov.strip()[:-2]
#     data.loc[data['单位名称1']==prov,'单位名称2']=prov
# for d in data['单位名称1']:
#     if d[-1:]=='省' or d[-3:]=='自治区' or d=='重庆市' or d=='北京市' or d=='天津市' or d=='上海市':
#         data.loc[data['单位名称1']==d,'省']=d
# data.to_excel(r'省.xlsx')

prov_dic={
"天津市":["和平区"],
"河北省":[
'河北省',
'井陉县',
'正定县',
'深泽县',
'元氏县',
'玉田县',
'遵化市',
'昌黎县',
'丛台区',
'桥东区',
'平乡县',
'清苑区',
'涞水县',
'蠡县',
'雄县',
'定州市',
'高碑店市',
'桥东区',
'宣化区',
'下花园区',
'蔚县',
'双桥区',
'鹰手营子矿区',
'沧州市',
'青县',
'东光县',
'盐山县',
'黄骅市',
'三河市',
'安平县',
'景县'
],
"山西省":[
'山西省',
'太原市',
'云冈区',
'广灵县',
'城区',
'矿区',
'郊区',
'平定县',
'上党区',
'城区',
'昔阳县',
'稷山县',
'垣曲县',
'河津市',
'定襄县',
'静乐县',
'偏关县',
'临汾市',
'尧都区',
'洪洞县',
'古县',
'乡宁县',
'汾西县'
],
"内蒙古自治区":[
'内蒙古自治区',
'回民区',
'赤峰市',
'宁城县',
'敖汉旗',
'科尔沁区',
'鄂尔多斯市',
'商都县'
],
"辽宁省":[
'辽宁省',
'和平区'
],
"吉林省":[
'吉林省',
'西安区'
],
"黑龙江省":['黑龙江省',
'郊区',
'西安区'
],
"上海市":['上海市'],
"江苏省":['江苏省'],
"浙江省":['浙江省','江北区'],
"安徽省":['安徽省','郊区'],
"福建省":['福建省'],
"江西省":['江西省'],
"山东省":['山东省'],
"河南省":['河南省'],
"湖北省":['湖北省'],
"湖南省":['湖南省'],
"广东省":['广东省','城区'],
"广西壮族自治区":['广西壮族自治区','城中区'],
"海南省":['海南省','三沙市'],
"重庆市":['江北区'],
"四川省":['四川省','西区'],
"贵州省":['贵州省'],
"云南省":['云南省'],
"西藏自治区":['西藏自治区'],
"陕西省":['陕西省'],
"甘肃省":['甘肃省'],
'青海省':['青海省','城中区'],
"宁夏回族自治区":['宁夏回族自治区'],
'新疆维吾尔自治区':['新疆维吾尔自治区','新市区','阿拉山口市','胡杨河市'],

}
for i in prov_dic:
    print()
pass


