#coding:utf-8
import time
import pypinyin
from selenium import webdriver
driver = webdriver.Firefox()

# cz_list=['上海虹桥\n', '杭州东\n', '西安北\n', '南昌西\n', '徐州东\n', '石家庄\n', '济南西\n', '成都东\n', '南宁东\n', '北京南\n', '苏州\n', '上饶\n', '昆明南\n', '昆山南\n', '无锡\n', '厦门北\n', '潮汕\n', '北京西\n', '义乌\n', '常州\n', '宁波\n', '嘉兴南\n', '福州\n', '武汉\n', '泉州\n', '沈阳\n', '德州东\n', '金华\n', '上海\n', '重庆北\n', '沈阳北\n', '苏州北\n', '蚌埠南\n', '汉口\n', '重庆西\n', '太原南\n', '湖州\n', '洛阳龙门\n', '福州南\n', '镇江\n', '温州南\n', '绍兴北\n', '漳州\n', '桂林北\n', '保定东\n', '天津西\n', '柳州\n', '常州北\n', '无锡东\n', '萍乡北\n', '哈尔滨西\n', '娄底南\n', '哈尔滨\n', '济南\n', '六安\n', '贺州\n', '淄博\n', '潍坊\n', '长春西\n', '南京\n', '汉中\n', '广元\n', '大连北\n', '兰州西\n', '华山北\n', '青岛北\n', '厦门\n', '丹阳\n', '衢州\n', '台州\n', '镇江南\n', '来宾北\n', '渭南北\n', '黄山北\n', '贵港\n', '南宁\n', '溧水\n', '宝鸡南\n', '三明北\n', '沧州西\n', '龙岩\n', '唐山\n', '漯河西\n', '商丘\n', '宿州东\n', '天水南\n', '诸暨\n', '深圳坪山\n', '四平东\n', '沈阳南\n', '安阳东\n', '溧阳\n', '宜昌东\n', '普宁\n', '天津南\n', '凯里南\n', '山海关\n', '泰安\n', '金华南\n', '滁州\n', '陆丰\n', '青岛\n', '鞍山西\n', '锦州南\n', '荆州\n', '汕尾\n', '宾阳\n', '枣庄\n', '温岭\n', '北海\n', '绵阳\n', '营口东\n', '安顺西\n', '新会\n', '茂名\n', '桐乡\n', '丹东\n', '潮阳\n', '南昌\n', '邵阳\n', '临汾西\n', '福清\n', '长春\n', '千岛湖\n', '长兴\n', '铁岭西\n', '铜陵\n', '池州\n', '芜湖\n', '马鞍山东\n', '湛江西\n', '安庆\n', '金寨\n', '本溪\n', '九江\n', '葫芦岛北\n', '内江北\n', '晋江\n', '鲅鱼圈\n', '呼和浩特东\n', '绍兴东\n', '三门峡南\n', '三水南\n', '铜陵北\n', '永修\n', '张家口\n', '海宁西\n', '嘉善南\n', '盘州\n', '铜仁南\n', '德阳\n', '北戴河\n', '佳木斯\n', '泰宁\n', '合肥\n', '共青城\n', '吉林\n', '江山\n', '高密\n', '邵东\n', '阳江\n', '涪陵北\n', '滕州东\n', '桐庐\n', '松江南\n', '大庆西\n', '德惠西\n', '威海\n', '丰都\n', '大庆东\n', '巢湖东\n', '平遥古城\n', '汕头\n', '鹿寨北\n', '永川东\n', '江油\n', '临海\n', '阳泉北\n', '德安\n', '永州\n', '余杭\n', '秦安\n', '福鼎\n', '大连\n', '白洋淀\n', '城固北\n', '牡丹江\n', '石柱县\n', '天门南\n', '郑州\n', '饶平\n', '醴陵东\n', '南充北\n', '岐山\n', '日照西\n', '青岛西\n', '恩施\n', '平原东\n', '青州市北\n', '兰考南\n', '金山北\n', '扶余北\n', '葵潭\n', '呼和浩特\n', '三门县\n', '南城\n', '合川\n', '盘锦\n', '肇东\n', '廊坊\n', '安达\n', '咸宁北\n', '齐齐哈尔南\n', '朝阳\n', '宾州\n', '海城西\n', '灵宝西\n', '南丰\n', '太谷西\n', '珠海\n', '灵石东\n', '宁强南\n', '邵阳北\n', '民权北\n', '苏州园区\n', '弋阳\n', '天津\n', '祁东\n', '昌图西\n', '乐清\n', '通渭\n', '齐齐哈尔\n', '韶山南\n', '胶州北\n', '红安西\n', '丹阳北\n', '从江\n', '瑞昌西\n', '霞浦\n', '汉川\n', '包头\n', '开原西\n', '全州南\n', '包头东\n', '祁阳\n', '瑞金\n', '于都\n', '桐梓东\n', '中山\n', '烟台\n', '长寿北\n', '闽清北\n', '岚山西\n', '霸州西\n', '隆回\n', '杭州\n', '衡山西\n', '鄱阳\n', '建始\n', '长汀南\n', '阆中\n', '胜芳\n', '歙县北\n', '无锡新区\n', '尚志南\n', '郑州西\n', '沙坪坝\n', '都昌\n', '北京北\n', '苍南\n', '英德西\n', '襄阳东\n', '涵江\n', '瓦房店西\n', '荣成\n', '隆昌北\n', '息烽\n', '枝江北\n', '荣昌北\n', '盖州西\n', '利川\n', '太姥山\n', '滨海西\n', '滦河\n', '冠豸山\n', '祁县东\n', '南陵\n', '公主岭南\n', '白沟\n', '东安东\n', '绥中北\n', '三穗\n', '临淄北\n', '东港北\n', '北票\n', '杜尔伯特\n', '奉化\n', '通远堡西\n', '眉山东\n', '乐山\n', '角美\n', '巩义南\n', '齐河\n', '鄂州\n', '定远\n', '雁荡山\n', '万州北\n', '枣阳\n', '赤壁北\n', '上海西\n', '璧山\n', '桃村北\n', '绥芬河\n', '大足南\n', '牟平\n', '牛河梁\n', '庆盛\n', '巴东\n', '大孤山\n', '南部\n', '青白江东\n', '辽中\n', '明港东\n', '射阳\n', '滨海港\n', '阿城北\n', '垫江\n', '赶水东\n', '昌乐\n', '樟树东\n', '梁平南\n', '青堆\n', '永嘉\n', '本溪新城\n', '普安县\n', '安亭北\n', '安江东\n', '淮北\n', '苍溪\n', '帽儿山西\n', '揭阳\n', '敦化\n', '青川\n', '苏州新区\n', '滨海北\n', '南芬北\n', '会昌北\n', '乐昌东\n', '承德南\n', '双峰北\n', '泰和\n', '白沙铺\n', '台安\n', '安图西\n', '通辽\n', '阳澄湖\n', '成都南\n', '朝天\n', '铜仁\n', '罗江东\n', '平泉北\n', '天镇\n', '泗阳\n', '承德县北\n', '察素齐\n', '图们北\n', '昌平\n', '彰武\n', '娄山关南\n', '彭山北\n', '三阳\n', '萨拉齐\n', '峡江\n', '甘旗卡\n', '大明湖\n', '长临河\n', '奈林皋\n', '南翔北\n', '焦作\n', '长寿湖\n', '平坝南\n', '六盘水\n', '宝华山\n', '桐梓北\n', '东戴河\n', '花桥\n', '仙林\n', '复盛\n', '南平北\n']
# cz_list='衡山西,英德西,襄阳东,三穗,临淄北,北票,巩义南,定远,赤壁北,上海西,庆盛,台安,朝天,铜仁,罗江东,平泉北,天镇,泗阳,承德县北,察素齐,昌平,彰武,娄山关南,甘旗卡,大明湖,焦作,长寿湖,平坝南,六盘水,宝华山,桐梓北,东戴河,花桥,仙林,复盛,南平北'.split(',')
cz_list=['百色', '大理', '楚雄', '平南南', '北京', '普者黑', '弥勒', '藤县', '桂林', '田东北', '田阳', '遂宁', '石林西', '禄丰南', '隆安东', '西宁', '乌鲁木齐', '吐鲁番北', '广州东', '东莞', '潼南', '南通', '台山', '榕江', '武昌', '赣州', '南江口', '南华', '鄯善北', '哈密', '玉林', '兴业', '恩平', '泰州', '南充', '阳西', '海安', '扬州', '福安', '乌鲁木齐南', '丽江', '金州', '吴川', '唐山北', '电白', '仙桃西', '开平南', '兰州', '山阴', '龙里北', '常德', '三都县', '吐哈', '长沙', '广州', '阳东', '双水镇', '随州', '陇南', '益阳', '小榄', '海石湾', '城子坦', '营山', '姜堰', '乐都', '南宁西', '大英东', '襄阳', '北井子', '庙山', '汤逊湖', '登沙河', '皮口', '岷县', '门源', '南湖东', '安陆', '临泽南', '山坡东', '石门县北', '达州', '杏树屯', '柳园南', '上海南', '鄂尔多斯', '汉寿', '玉门', '徐水', '保定', '蓬莱市', '江都', '十堰', '启东', '东岔', '谷城', '龙口市', '延安', '犍为', '青神', '鹤庆', '徐州', '陆川', '青莲', '云梦', '正定', '敦煌', '宾西北', '瓜州', '曹妃甸东', '常山', '蓟州', '清水北', '双流西', '沧州', '南堡北', '托克托东', '曹妃甸港', '嘉兴', '长沙西', '峨眉', '黔江', '蚌埠', '中川机场', '深圳', '海宁', '成都', '阜阳', '泥溪', '旗下营南', '菏泽', '聊城', '土地堂东', '德州', '闵集', '常平', '定州', '土溪', '八方山', '东方', '双吉']
name_list= {}
name_list1= {}

for c in cz_list:
    s = ''
    for i in pypinyin.pinyin(c, style=pypinyin.NORMAL):
        s += ''.join(i)
    url="http://www.huochepiao.com/dongche/chezhan_{0}".format(s)
    driver.get(url)
    t=driver.find_elements_by_xpath('/html/body/div[5]/div[1]/div/table/tbody')
    print(t)

    for i in t:
        t1=i.text.split('\n')
    del t1[0]

    lx=[j.split(' ')[8] for j in t1]
    lx=set(lx)
    if '动车组' in lx and '高速铁路' in lx:
        name_list[c]=list(lx)
    else:
        name_list1[c]=list(lx)
    # print(lx)
    pass

driver.quit()
# print(name_list)
print(name_list1)


