import psycopg2
#
# with open(r'高铁站.txt','r') as f:
#     gt=f.readlines()
#
#
#
# with open(r'动车站含高铁.txt','r') as f1:
#     dc=f1.readlines()
#
# gt_dic={}
# for d in dc:
#     gt_dic[d]=''
# for g in gt:
#     gt_dic[g]=1
# dc_list=[]
# gt_list=[]
# for i in gt_dic.keys():
#     if gt_dic[i]=='':
#         dc_list.append(i[:-1])
#     elif gt_dic[i]==1:
#         gt_list.append(i[:-1])
# print(dc_list)
# print(gt_list)
# with open(r'dc.txt','a+') as w:
#     w.write('\n'.join(dc_list))
#
# with open(r'dc_gt.txt','a+') as w1:
#     w1.write('\n'.join(gt_list))
with open(r'result/dc.txt', 'r') as f:
    gt_dc=f.readlines()

gt_dc=[dc[:-1] for dc in gt_dc]
# gt_dc='衡山西,襄阳东,铜仁,昌平,彰武,娄山关南,甘旗卡,大明湖,焦作,长寿湖,平坝南,六盘水,宝华山,英德西,三穗,临淄北,北票,巩义南,罗江东,平泉北,天镇,泗阳,承德县北,察素齐'.split(',')
null_list=[]
gt_chnnel_id=[]
conn = psycopg2.connect(database="yx_test", user="postgres", password="123456", host="121.89.179.247", port="5432")
if conn is not None:
    print(conn)
    print ("Opened database successfully")
    cur = conn.cursor()
    for gt in gt_dc:
        sql="select id,channel_name,channel_subtype from channel_info where channel_name like '%{0}站'".format(gt)
        print(sql)
        cur.execute(sql)
        rows = cur.fetchall()
        if rows==[]:
            null_list.append(gt)
            # print(gt[:-1])
        else:
            gt_chnnel_id.append(gt)
            # print(rows)

    print(null_list)
    # for g in gt_chnnel_id:
    #     print(g)
#
# l=['广州南', '南京南', '长沙南', '深圳北', '郑州东', '合肥南', '衡阳东', '贵阳北', '郴州西', '佛山西', '肇庆东', '韶关', '莆田', '怀化南', '鹰潭北', '岳阳东', '宜兴', '虎门', '香港西九龙', '信阳东', '梧州南', '福田', '余姚北', '惠州南', '邯郸东', '宜春', '秦皇岛', '贵阳东', '驻马店西', '丽水', '桂林西', '济南东', '曲阜东', '株洲西', '南平市', '延平', '邢台东', '运城北', '新余北', '遵义', '永康南', '杨陵南', '潍坊北', '全椒', '鹤壁东', '新乡东', '都匀东', '缙云西', '淄博北', '曲靖北', '辽阳', '宁德', '抚州', '恭城', '德清', '婺源', '许昌东', '清河', '湘潭北', '庐山', '绩溪北', '青田', '莱阳', '鄠邑', '钟山西', '武义北', '诏安', '尤溪', '宁海', '侯马西', '青州市', '怀集', '阳朔', '南靖', '衡水北', '开封北', '淮南南', '烟台南', '云霄', '仙游', '建德', '建瓯西', '阜阳西', '玉山南', '云浮东', '麻城北', '介休东', '漳浦', '永福南', '潜江', '将乐', '涿州东', '古田北', '萧县北', '洋县西', '武夷山北', '平阳', '无为', '景德镇北', '高碑店东', '渑池南', '三江南', '富阳', '凤城东', '定西北', '定州东', '咸阳秦都', '永城北', '霍州东', '依兰', '即墨北', '方正', '建宁县北', '永安南', '阜新', '高密北', '永济北', '吉安西', '佛坪', '广州北', '盘锦北', '漳平西', '清远', '宜宾西', '淮南东', '瑞安', '进贤南', '綦江东', '黄石北', '阳新', '洪洞西', '新化南', '抚州东', '闻喜西', '邹平', '大同南', '禹城东', '汨罗东', '高安', '乌兰察布', '三明', '毕节', '惠东', '鲘门', '连云港', '章丘北', '兴国西', '阿房宫', '贵定北', '耒阳西', '正定机场', '资中北', '芷江', '永泰', '溆浦南', '惠山', '洞口', '哈尔滨北', '光明城', '庄河北', '资阳北', '十堰东', '砀山南', '忻州西', '大冶北', '襄汾西', '赣州西', '亚布力西', '古田会址', '孝感东', '泾县', '惠安', '龙游', '董家口', '新晃西', '旌德', '梅州西', '宣化北', '连江', '水家湖', '富源北', '原平西', '辛集南', '当涂东', '晋中', '赣榆', '兴安北', '剑门关', '高邑西', '双城北', '武当山西', '繁昌西', '海林北', '怀来', '威海北', '景州', '延平西', '湖口', '江宁', '寿县', '海阳北', '绅坊', '普湾', '双洋', '简阳南', '谷城北', '丹江口', '瓦屋山', '武胜', '西渡', '响水县', '盐城', '下花园北', '阜宁东', '颍上北', '珞璜南', '戚墅堰', '双流机场', '怀安', '新民北', '天河机场', '孝感北', '夏格庄', '遵义南', '穆棱', '亳州南', '高楞', '句容西', '黔西', '延吉西', '五府山', '雁石南', '德兴', '绥阳', '宿迁', '邵阳西', '苇河西', '藁城南', '随州南', '淮安东', '丰顺东', '广汉北', '揭阳机场', '凤台南', '枫林', '八达岭长城', '石家庄东', '横道河子东', '蛟河西', '五龙背东', '黑山北', '弋江', '新都东', '新干东', '周口东', '兴文', '喀左', '江油北', '胜利镇', '镇雄', '东花园北', '涟水', '文登东', '吉水西', '灌云', '淮北北', '赣县北', '一面坡北', '兴和北', '杨桥', '江宁西', '玉溪', '关岭', '珲春', '阳高南', '长宁', '修文县', '嵩明', '卓资东', '万安县', '庄桥', '南阳东', '新津', '合肥北城', '大方', '睢宁', '平顶山西', '云梦东', '威信', '黄冈东', '屏山', '界首南', '商丘东', '太子城', '太和东', '朱砂古镇', '丰城东', '邓州东', '扶沟南', '西华', '沈丘北', '淮阳南', '新津南', '禹州', '安陆西', '军粮城北', '蒙山', '临沂北', '芦庙', '建桥', '六枝南', '临泉', '随县', '古城东', '黄桶北', '武夷山东', '郏']
# for i in l:
#     print(i)

